# 3. Є ситуація: Кейд живе за адресою 1516 Henry Street, Берклі, Каліфорнія 94709, США.
# Він має ступінь бакалавра біології в Каліфорнійському університеті з 2011 року. Його
# інтереси: птахи, екологія, довкілля, фотографія і подорожі. Він відвідав Канаду та
# Францію.
# Емма живе за адресою Carrer de la Guardia Civil 20, 46020 Valencia, Spain. Вона має
# ступінь магістра хімії в Університеті Валенсії з 2015 року. Її сфера знань включає
# управління відходами , токсичні відходи, забруднення повітря. Її інтереси: їзда на
# велосипеді, музика та подорожі. Вона відвідала Португалію, Італію, Францію, Німеччину,
# Данію та Швецію.
# Кейд знає Емму. Вони зустрілися в Парижі в серпні 2014 року.

# • використовуючі словники FOAF, RDF, XSD тощо та власні URI (наприклад,
# створені на базі http://example.org/) створіть RDF граф за допомогою RDFLib;
# • виконайте візуалізацію та сериалізацію графу у різні формати;
# • запишіть свій граф у файл у форматі TURTLE;
# • перегляньте файл і відредагуйте його так, щоб Кейд також відвідував Німеччину і
# щоб Еммі було 36 років;
# • виведіть на консоль усі трійки графу;
# • виведіть на консоль трійки, що стосуються лише про Емму;
# • виведіть на консоль трійки, що містять імена людей.
from rdflib import URIRef, BNode, RDF, Graph, Namespace, FOAF, XSD, Literal

graph = Graph()

keid = URIRef('http://example.com/Keid')
lives = URIRef('http://example.com/ontology/lives')

graph.add((keid, lives, Literal('1516 Henry Street, Берклі, Каліфорнія 94709, США', datatype=XSD.string)))

print(graph.serialize(format='ttl'))
